{
    "app": {
        "meta": {
            "title": "Matija Kočevar | Portfolio",
            "description": "Personal portfolio showcasing my projects, experience, and skills"
        }
    },
    "common": {
        "connect": "Connect",
        "language": {
            "toggle": "Change language"
        },
        "present": "Present"
    },
    "nav": {
        "home": "Home",
        "about": "About",
        "projects": "Projects",
        "education": "Education",
        "experience": "Experience",
        "skills": "Skills",
        "interests": "Interests & Hobbies",
        "openGithub": "Open GitHub",
        "openLinkedIn": "Open LinkedIn",
        "openResume": "Open Resume",
        "sign-in": "Sign in",
        "sign-up": "Sign up",
        "factor-one": "Factor One",
        "service-worker": {
            "js": "Service Worker"
        },
        "icon-192x192": {
            "png": "Badge"
        },
        "dashboard": "Dashboard"
    },
    "home": {
        "title": "Home",
        "welcome": "Welcome to the home page",
        "meta": {
            "title": "Matija Kočevar | Home",
            "description": "Home page"
        },
        "bio": {
            "role": "Software Developer",
            "tagline": "Passionate about creating elegant solutions to complex problems",
            "techStack": {
                "react": "React",
                "vue": "Vue",
                "nextjs": "Next.js",
                "typescript": "TypeScript",
                "cSharp": "C#",
                "php": "PHP",
                "postgres": "PostgreSQL",
                "sql": "Sql Server"
            }
        },
        "projects": {
            "title": "Active Projects",
            "navigation": {
                "prev": "Previous project",
                "next": "Next project"
            },
            "links": {
                "demo": "Live Demo",
                "code": "Code"
            },
            "wip": "Work in Progress",
            "items": {
                "zelda": {
                    "title": "A Tie to the Past",
                    "description": "A Zelda-like game clone built with Typescript and Phaser.js"
                },
                "anasPlace": {
                    "title": "Ana's Place",
                    "description": "A modern web application for managing a small nail saloon"
                },
                "spaceInvaders": {
                    "title": "Space Invaders",
                    "description": "A clone of the classic Space Invaders game built with Typescript"
                },
                "taskManagement": {
                    "title": "Task Management",
                    "description": "A task management application built with React, .NET and SQL Server"
                }
            }
        }
    },
    "about": {
        "title": "About Me",
        "meta": {
            "title": "Matija Kočevar | About",
            "description": "Learn about my journey as a software developer, my skills, and what drives me"
        },
        "sections": {
            "journey": "My Journey",
            "capabilities": "What I Do",
            "currentFocus": "Current Focus"
        },
        "content": {
            "journey": "I studied programming in school but didn't complete college, which led me to work in sales initially. \n\n After a few years in sales roles where I wasn't finding fulfillment, I found myself in a position at work where I needed a tool to help me with my job but the company didn't have the resources to create it. This eventually lead me to start learning web development on my own because I knew I could create the tool I needed. One thing led to another, and I made a web scraper which shortened my work significantly. \n\n I continued learning about modern frameworks and tools and fell in love with developing again. I kept up learning for almost a year, and then I got my first job as a developer. \n Since then, I've worked on various projects, both independently and in teams, which have helped me grow as a developer. I enjoy the challenge of solving complex problems and creating elegant solutions that enhance user experiences.",
            "currentFocus": "While I enjoy full-stack development, my primary focus is on frontend development where I can combine my technical skills with my passion for creating intuitive and engaging user experiences. I excel in React and TypeScript development, always staying updated with the latest frontend technologies and best practices. My approach combines technical excellence with a keen eye for user experience, ensuring that I deliver solutions that are both powerful and user-friendly."
        },
        "capabilities": {
            "frontend": {
                "title": "Frontend Development",
                "items": [
                    "Building responsive and interactive web applications",
                    "Working with React, Vue, and Next.js",
                    "Crafting elegant user interfaces with TypeScript",
                    "Implementing modern design patterns and best practices",
                    "Creating accessible and performant web experiences",
                    "Developing reusable component libraries"
                ]
            },
            "fullstack": {
                "title": "Full Stack Capabilities",
                "items": [
                    "Developing backend services with .NET and Node.js",
                    "Database design and optimization (SQL Server, PostgreSQL)",
                    "API development and integration",
                    "DevOps and deployment workflows",
                    "System architecture and scalability planning",
                    "Technical documentation and code review"
                ]
            }
        }
    },
    "projects": {
        "title": "Projects",
        "description": "Here are some of the projects I've worked on. Each project represents different challenges and learning experiences.",
        "meta": {
            "title": "Matija Kočevar | Projects",
            "description": "A showcase of my development projects and technical work"
        },
        "showcase": {
            "liveDemo": "Live Demo",
            "github": "GitHub",
            "projectDescriptions": {
                "zelda": "A tribute game inspired by The Legend of Zelda, built with modern web technologies",
                "spaceInvaders": "A clone of Space Invaders in TypeScript",
                "anasPlace": "A custom website for managing a small nail saloon",
                "taskManagement": "A comprehensive task management system for organizing and tracking tasks",
                "portfolioV2": "Second iteration of my personal portfolio",
                "portfolioV1": "First version of my portfolio website",
                "vueDynamicForms": "A basic web app with routing built with Vue.js",
                "diffingApi": "An API service for comparing and finding diffs in two base 64 encoded strings",
                "drumBox": "An MIDI playback tool for creating and playing drum patterns",
                "holidaysCalculator": "A tool for calculating and managing holiday dates in Slovenia",
                "roles": "A full-stack web app for managing user roles and permissions"
            }
        }
    },
    "education": {
        "title": "Education",
        "description": "This will be the education page",
        "meta": {
            "title": "Matija Kočevar | Education",
            "description": "Education"
        }
    },
    "experience": {
        "title": "Experience",
        "description": "My experience so far has been a mix of self-learning and professional development. I have worked on various projects, both independently and in teams, which have helped me grow as a developer.",
        "technologies": {
            "title": "Technologies"
        },
        "timeline": {
            "select": "Please select an item from the timeline",
            "position": "Position"
        },
        "descriptions": {
            "6": "Started a new job as a Vue.js developer. Working on both legacy Vue 2 applications and new React projects. Lead frontend developer for new React project.",
            "5": "Developed React table library with advanced features. Worked on porting Laravel API to .NET. Created Microsoft Power Platform components.",
            "4": "Worked on a large-scale Vue.js/Angular application with 24/7 availability. Gained experience with Linux and Docker.",
            "3": "Full-stack development with focus on React and Typescript. Worked with .NET and SQL on backend.",
            "2": "After years of working in sales and having jobs where I didn't really enjoy myself, I began learning how to develop web apps. I used tutorials and independent searches to find out about modern frameworks and started making my own projects. The stacks I looked at were HTML, CSS, SQL, React JS, Vue JS, Node, .NET Core, and C#.",
            "1": "Created semi-automated Excel documents for sales & stock overview. Developed automated price checking system using Google App Scripts. Created a web scraper with React.js for price comparison."
        },
        "meta": {
            "title": "Matija Kočevar | Experience",
            "description": "Experience"
        }
    },
    "skills": {
        "title": "Skills",
        "description": "Overview of my technical skills and expertise",
        "meta": {
            "title": "Matija Kočevar | Skills",
            "description": "Overview of my technical skills and expertise"
        },
        "sections": {
            "webDevelopment": {
                "title": "Web Development",
                "frontend": "Frontend Development",
                "backend": "Backend Development",
                "database": "Database & Tools"
            },
            "design": {
                "title": "Design"
            }
        },
        "tech": {
            "react": "React",
            "nextjs": "Next.js",
            "vue": "Vue.js",
            "angular": "Angular",
            "typescript": "TypeScript",
            "javascript": "JavaScript",
            "html5": "HTML5",
            "cssSass": "CSS/SASS",
            "tailwind": "Tailwind",
            "cSharp": "C#",
            "dotnet": ".NET",
            "nodejs": "Node.js",
            "php": "PHP",
            "python": "Python",
            "postgres": "PostgreSQL",
            "mssql": "SQL Server",
            "docker": "Docker",
            "git": "Git",
            "photoshop": "Photoshop",
            "illustrator": "Illustrator",
            "figma": "Figma",
            "inkscape": "Inkscape"
        },
        "descriptions": {
            "react": "I have extensive experience with React, having used it in numerous professional projects.\n\n I'm proficient with modern React patterns and is the framework I use for most of my projects and I am confident in acomplishing any task thrown my way in web development. Because I use Next.js regularly, I have a deep understanding of React's ecosystem, including hooks, context API, and state management libraries like Zustand.\n\n I can build SPAs and complex applications with ease, implementing best practices for performance and maintainability.",
            "nextjs": "Since I started with React it was natural for me to start using Next.js.\n\n I have experience with both static and server-side rendering, API routes, and dynamic routing. I can build full-stack applications very quickly with Next.js, and I have experience with deploying Next.js applications on platforms like Vercel.\n\n I am able to create fully functional applications with Next.js, including authentication, data fetching, and routing.",
            "vue": "I have strong experience with Vue.js, working with both Vue 2 and Vue 3 in professional settings.\n\n I'm well-versed in both the Options API and Composition API, and have built complex applications using Vuex/Pinia for state management.\n\n I've worked on large-scale Vue applications with 24/7 availability requirements and also smaller project. ",
            "angular": "This is the framework I have the least experience with, but I have worked on a large-scale Angular application in a professional setting. I'm familiar with Angular's core concepts, including components, services, and dependency injection.\n\n I can implement routing, forms, and HTTP requests in Angular applications. I can also work with RxJS for reactive programming and state management.",
            "typescript": "I use TypeScript extensively in my daily work, implementing type-safe solutions across frontend and backend.\n\n I can create complex type definitions, interfaces, and generics to ensure code quality and maintainability. I have experience with TypeScript in both React, Vue, Angular and Next.js environments, and I'm familiar with advanced TypeScript features like decorators and mapped types. I can implement type-safe APIs and libraries, ensuring that my code is robust and easy to understand.\n\n I preffer to use TypeScript over JavaScript in all of my projects, and I can easily convert JavaScript codebases to TypeScript.",
            "javascript": "While I primarily use TypeScript, I have a strong foundation in JavaScript and can work with both ES5 and ES6+ features.\n\n I'm familiar with modern JavaScript syntax, including async/await, destructuring, and spread/rest operators. I can implement complex algorithms and data structures in JavaScript, and I'm comfortable working with both functional and object-oriented programming paradigms.",
            "html5": "I have a strong understanding of HTML5 and its semantic elements.\n\n I can create accessible and SEO-friendly markup, implementing best practices for web standards. I'm familiar with HTML5 features like audio/video embedding, canvas, and local storage. I can implement responsive design techniques using HTML5 and CSS.",
            "cssSass": "I'm proficient in creating responsive and maintainable CSS architectures using SASS.\n\n I implement modern CSS features like Grid and Flexbox, and use SASS features like mixins and functions to create scalable styling solutions.\n\n I have a good eye for detail and can create visually appealing and user-friendly designs.",
            "tailwind": "I use Tailwind CSS extensively in my projects, creating custom designs and maintaining consistent UI patterns.\n\n I'm experienced with customizing Tailwind configurations, creating reusable components, implementing themes, and using Tailwind's utility-first approach to styling.\n\n I can create responsive designs with ease, ensuring that my applications look great on all devices.",
            "cSharp": "I've built backend services using C# and .NET, implementing clean architecture patterns, MVC patterns and SOLID principles.\n\n I have experience with ASP.NET Core, Entity Framework, and building RESTful APIs. I've worked on both monolithic and microservice architectures.",
            "dotnet": "I have extensive experience with the .NET ecosystem, building web APIs and services. I've worked with various .NET features including dependency injection, middleware, and authentication. I've implemented both REST APIs and gRPC services.",
            "nodejs": "I've built backend services with Node.js using Express and NestJS, implementing RESTful APIs and real-time features with WebSockets.",
            "php": "I have experience working with PHP in professional environments, particularly with Laravel and Symfony frameworks.\n\n I've built RESTful APIs and integrated with various databases and third-party services.",
            "python": "I've used Python for backend development and data analysis tasks. I have experience with Django and FastAPI frameworks, building RESTful APIs and implementing data processing pipelines.",
            "postgres": "I work regularly with PostgreSQL. I have enough experience to write basic queries and use the ecosystem to create and manage databases. \n\n I usually can complete any task on my own, but if things get complicated I always ask for help or offload the task to a DBA.",
            "mssql": "I have experience with SQL Server. I have enough experience to write basic queries and use the ecosystem to create and manage databases.\n\n I usually can complete any task on my own, but if things get complicated I always ask for help or offload the task to a DBA.",
            "docker": "I use Docker daily for development and deployment, creating optimized multi-stage builds and managing container orchestration.\n\n I have experience with Docker Compose for local development and container networking.",
            "git": "I use Git daily for version control, implementing branching strategies and maintaining clean commit histories.\n\n I'm experienced with advanced Git features, CI/CD integrations, and collaborative development workflows.",
            "photoshop": "I use Photoshop for image editing and asset creation in web development projects.\n\n I can efficiently prepare and optimize images for web use, create UI elements, and edit photos for various purposes.",
            "illustrator": "I work with Illustrator to create vector graphics and icons for web projects.\n\n I can design and export scalable graphics, maintaining consistency across different screen sizes.",
            "figma": "I use Figma extensively for UI/UX design and collaboration.\n\n I create and maintain design systems, build interactive prototypes, and collaborate effectively with design teams. I'm proficient with auto-layout, components, and design tokens.",
            "inkscape": "I use Inkscape for creating and editing SVG graphics for web projects.\n\n I can efficiently create and optimize vector graphics, maintaining high quality across different screen sizes."
        }
    },
    "interests": {
        "title": "Interests & Hobbies",
        "description": "This will be the interests page",
        "meta": {
            "title": "Matija Kočevar | Interests",
            "description": "Interests"
        },
        "youtube": {
            "title": "My YouTube Content",
            "videos": {
                "title": "Music Videos",
                "loading": "Loading videos...",
                "noVideos": "No videos found",
                "navigation": {
                    "prev": "Previous video",
                    "next": "Next video"
                },
                "counter": "{current} of {total}"
            },
            "shorts": {
                "title": "Shorts",
                "loading": "Loading shorts...",
                "noShorts": "No shorts found",
                "navigation": {
                    "prev": "Previous short",
                    "next": "Next short"
                },
                "counter": "{current} of {total}"
            }
        }
    },
    "components": {
        "projectCard": {
            "liveDemo": "Live Demo",
            "github": "GitHub"
        },
        "banner": {
            "title": "Redesign in progress!",
            "description": "I'm completely rebuilding my portfolio from scratch with some cool new features and a fresh design!",
            "previousPortfolio": "Switch to previous version "
        },
        "themeToggle": {
            "switchMode": "Switch to {mode} mode",
            "dark": "Dark",
            "light": "Light",
            "changeColor": "Change color"
        }
    },
    "themes": {
        "default": "Default",
        "red": "Red",
        "blue": "Blue",
        "green": "Green",
        "yellow": "Yellow",
        "violet": "Violet"
    },
    "auth": {
        "signIn": {
            "title": "Sign In",
            "description": "Enter your email and password to access your account",
            "emailLabel": "Email",
            "emailPlaceholder": "name@example.com",
            "passwordLabel": "Password",
            "passwordPlaceholder": "••••••••",
            "submitButton": "Sign In",
            "loadingButton": "Signing in...",
            "noAccountText": "Don't have an account? Sign up",
            "errors": {
                "default": "Something went wrong. Please try again.",
                "invalidCredentials": "Failed to sign in. Please check your credentials."
            }
        },
        "signUp": {
            "title": "Sign Up",
            "description": "Create your account to get started",
            "firstNameLabel": "First name",
            "lastNameLabel": "Last name",
            "emailLabel": "Email",
            "emailPlaceholder": "name@example.com",
            "passwordLabel": "Password",
            "passwordPlaceholder": "••••••••",
            "confirmPasswordLabel": "Confirm Password",
            "confirmPasswordPlaceholder": "••••••••",
            "submitButton": "Sign Up",
            "loadingButton": "Creating Account...",
            "hasAccountText": "Already have an account? Sign in",
            "errors": {
                "default": "Failed to sign up. Please try again.",
                "passwordMismatch": "Passwords do not match"
            }
        },
        "signOut": "Sign Out"
    }
}
