{
    "app": {
        "meta": {
            "title": "Matija Kočevar | Portfolio",
            "description": "Osebni portfolio z mojimi projekti, izkušnjami in veščinami"
        }
    },
    "common": {
        "connect": "Poveži se",
        "language": {
            "toggle": "izberi jezik"
        },
        "present": "Tekoče"
    },
    "nav": {
        "home": "Domača stran",
        "about": "O meni",
        "projects": "Projekti",
        "education": "Izobrazba",
        "experience": "Izkušnje",
        "skills": "Veščine",
        "interests": "Interesi & hobiji",
        "openGithub": "Odpri GitHub",
        "openLinkedIn": "Odpri LinkedIn",
        "openResume": "Odpri življenjepis",
        "sign-in": "Prijava",
        "sign-up": "Registracija",
        "factor-one": "Factor One",
        "icon-192x192": {
            "png": "Badge"
        }
    },
    "home": {
        "title": "Domov",
        "welcome": "Dobrodošli na domači strani",
        "meta": {
            "title": "Matija Kočevar | Domov",
            "description": "Domača stran"
        },
        "bio": {
            "role": "Razvijalec programske opreme",
            "tagline": "Navdušen nad ustvarjanjem elegantnih rešitev za kompleksne probleme",
            "techStack": {
                "react": "React",
                "vue": "Vue",
                "nextjs": "Next.js",
                "typescript": "TypeScript",
                "csharp": "C#",
                "php": "PHP",
                "postgresql": "PostgreSQL",
                "sqlserver": "Sql Server"
            }
        },
        "projects": {
            "title": "Aktivni projekti",
            "navigation": {
                "prev": "Prejšnji projekt",
                "next": "Naslednji projekt"
            },
            "links": {
                "demo": "Demonstracija",
                "code": "Koda"
            },
            "wip": "V izdelavi",
            "items": {
                "zelda": {
                    "title": "A Tie to the Past",
                    "description": "Klon igre v stilu Zelda, narejen z TypeScript in Phaser.js"
                },
                "anasPlace": {
                    "title": "Ana's Place",
                    "description": "Moderna spletna aplikacija za upravljanje manjšega manikirnega salona"
                },
                "spaceInvaders": {
                    "title": "Space Invaders",
                    "description": "Klon igre Space Invaders, narejen z TypeScript"
                },
                "taskManagement": {
                    "title": "Task Management",
                    "description": "Spletna aplikacija za upravljanje nalog, narejena z React, .NET in SQL Server"
                }
            }
        }
    },
    "about": {
        "title": "O meni",
        "meta": {
            "title": "Matija Kočevar | O meni",
            "description": "Spoznajte mojo pot kot razvijalec programske opreme, moje veščine in kaj me žene"
        },
        "sections": {
            "journey": "Moja pot",
            "capabilities": "Kaj počnem",
            "currentFocus": "Trenutni fokus"
        },
        "content": {
            "journey": "V šoli sem študiral programiranje, vendar študija nisem dokončal, zaradi česar sem sprva delal v prodaji. \n\n Po nekaj letih dela v prodaji, kjer nisem našel izpopolnitve, sem se znašel v položaju, kjer sem pri delu potreboval določeno orodje za katerega podjetje ni imelo sredstev za razvoj. To me je vodilo do tega, da sem se ponovno začel učiti spletnega razvoja saj sem vedel, da lahko ustvarim orodje, ki ga potrebujem. Eno je vodilo k drugemu in ustvaril sem spletnega pajka, ki je občutno skrajšal moje delo. \n\n Nadaljeval sem z učenjem o sodobnih ogrodjih in orodjih ter se ponovno zaljubil v razvoj. Učil sem se skoraj leto dni, nato pa sem dobil svojo prvo službo kot razvijalec. \n Od takrat sem delal na različnih projektih, tako samostojno kot v ekipah, ki so mi pomagali rasti kot razvijalcu. Uživam v izzivih reševanja kompleksnih problemov in ustvarjanju elegantnih rešitev, ki izboljšujejo uporabniško izkušnjo.",
            "currentFocus": "Čeprav uživam v full-stack razvoju, je moj primarni fokus na frontend razvoju, kjer lahko združim svoje tehnične veščine s strastjo do ustvarjanja intuitivnih in privlačnih uporabniških izkušenj. Odlikujem se v razvoju z React in TypeScript tehnologijami, pri čemer se neprestano izpopolnjujem v najnovejših frontend tehnologijah in dobrih praksah. Moj pristop združuje tehnično odličnost s pozornostjo na uporabniško izkušnjo, kar zagotavlja, da dostavim rešitve, ki so hkrati zmogljive in uporabnikom prijazne."
        },
        "capabilities": {
            "frontend": {
                "title": "Frontend razvoj",
                "items": [
                    "Razvoj odzivnih in interaktivnih spletnih aplikacij",
                    "Delo z React, Vue in Next.js ogrodji",
                    "Oblikovanje elegantnih uporabniških vmesnikov s TypeScript",
                    "Implementacija modernih vzorcev oblikovanja in dobrih praks",
                    "Ustvarjanje dostopnih in zmogljivih spletnih izkušenj",
                    "Razvoj knjižnic ponovno uporabnih komponent"
                ]
            },
            "fullstack": {
                "title": "Full Stack zmožnosti",
                "items": [
                    "Razvoj backend storitev z .NET in Node.js",
                    "Načrtovanje in optimizacija podatkovnih baz (SQL Server, PostgreSQL)",
                    "Razvoj in integracija API-jev",
                    "DevOps in postavitev v produkcijo",
                    "Načrtovanje sistemske arhitekture in skalabilnosti",
                    "Tehnična dokumentacija in pregled kode"
                ]
            }
        }
    },
    "projects": {
        "title": "Projekti",
        "description": "Tukaj so nekateri projekti, na katerih sem delal. Vsak projekt predstavlja različne izzive in priložnosti za učenje.",
        "meta": {
            "title": "Matija Kočevar | Projekti",
            "description": "Pregled mojih razvojnih projektov in tehničnega dela"
        },
        "showcase": {
            "liveDemo": "Demonstracija",
            "github": "GitHub",
            "projectDescriptions": {
                "zelda": "Igra po navdihu The Legend of Zelda, zgrajena z modernimi spletnimi tehnologijami",
                "spaceInvaders": "Klon igre Space Invaders v TypeScript",
                "anasPlace": "Spletna stran za upravljanje manjšega manikirnega salona",
                "taskManagement": "Celovit sistem za upravljanje in sledenje nalogam",
                "portfolioV3": "Tretja iteracija mojega osebnega portfolia",
                "portfolioV2": "Druga iteracija mojega osebnega portfolia",
                "portfolioV1": "Prva verzija moje spletne strani s portfoliem",
                "vueDynamicForms": "Osnovna spletna aplikacija z usmerjanjem, narejena z Vue.js",
                "diffingApi": "API storitev za primerjavo in iskanje razlik v dveh base 64 kodiranih nizih",
                "drumBox": "MIDI predvajalnik za ustvarjanje in predvajanje ritmičnih vzorcev",
                "holidaysCalculator": "Orodje za izračunavanje in upravljanje dopustov v Sloveniji",
                "roles": "Full-stack aplikacija za upravljanje vlog in pravic uporabnikov"
            }
        }
    },
    "education": {
        "title": "Izobrazba",
        "description": "To bo stran z izobrazbo",
        "meta": {
            "title": "Matija Kočevar | Izobrazba",
            "description": "Izobrazba"
        }
    },
    "experience": {
        "title": "Izkušnje",
        "description": "Moje izkušnje so bile mešanica samostojnega učenja in profesionalnega razvoja. Delal sem na različnih projektih, tako samostojno kot v ekipah, kar mi je pomagalo rasti kot razvijalec.",
        "technologies": {
            "title": "Tehnologije"
        },
        "timeline": {
            "select": "Prosim izberite element iz časovnice",
            "position": "Pozicija"
        },
        "descriptions": {
            "6": "Začel novo službo kot Vue.js razvijalec z delom na vzdrževanju in izboljšavah obstoječih Vue 2 aplikacij. Ustvaril nov Vue 3 projekt od začetka in razvil več prototipnih aplikacij. Vodilni razvijalec novega React projekta, vodenje razvoja in sprejemanje ključnih arhitekturnih odločitev.\n\nRazširil tehnično znanje z učenjem Java Spring Boot razvoja, poglobil znanje Docker kontejnerizacije in PHP Symfony ogrodja. Prevzel dodatne odgovornosti, vključno z UI/UX oblikovanjem v Figmi in mentorstvom novih zaposlenih.",
            "5": "Razvil React knjižnico za tabele z naprednimi funkcijami in ustvaril samostojne poslovne aplikacije za interno uporabo. Obsežno delal z Microsoft SharePoint integracijo in razvil custom Canvas aplikacije znotraj Power Platform ekosistema. Prav tako sem delal z veliko manjših projektov s tehnologijo kot je Next.js ali samo navaden Javascript.\n\nSodeloval pri projektu migracije Laravel API-ja v .NET.",
            "4": "Delal na obsežni Vue.js/Angular aplikaciji z 24/7 razpoložljivostjo. Delal sem na migraciji obstoječe kode v Vue 3, ob sočasnem vzdrževanju in razvoju novih funkcionalnosti v Angularju. Delal s PHP Symfony ogrodjem za backend razvoj.\n\nPridobil obsežne izkušnje z Linux in Docker okolji za namestitev in lokalni razvoj. Delal v agilnem okolju z uporabo SCRUM metodologije za vodenje projektov.",
            "3": "Full-stack razvoj s poudarkom na React in TypeScript v svoji prvi vlogi profesionalnega razvijalca. Sodeloval pri razvoju nove spletne strani podjetja in delal na spletni aplikaciji z uporabo React-a na frontend strani. Ustvaril interaktivno knjižnico za prikaz podatkov na vnaprej določenih SVG zemljevidih.\n\nDelal z .NET in SQL na backend projektih, razvijal in vzdrževal rešitve za upravljanje vsebin z uporabo Umbraco CMS in C# Razor strani ter pridobival izkušnje z osnovnim spletnim oblikovanjem in izdelavo UI elementov.",
            "2": "Po letih dela v prodaji in službah, kjer nisem bil zares zadovoljen, sem začel učenje razvoja spletnih aplikacij. Uporabljal sem tutoriale in samostojno raziskoval moderne frameworke ter začel razvijati lastne projekte.\n\nTehnologije, ki sem jih raziskoval so bile HTML, CSS, SQL, React JS, Vue JS, Node, .NET Core in C#.",
            "1": "Ustvaril pol-avtomatizirane Excel dokumente za pregled prodaje in zalog, z uporabo formul in makrov za spremljanje prodajne uspešnosti in zaloge v trgovini. Razvil avtomatiziran sistem za preverjanje cen z uporabo Google App Scripts, ki je primerjal cene na spletu z našimi cenami in odpravil potrebo po ročnem preverjanju, kar je prihranilo več ur dela dnevno.\n\nUstvaril celovit spletni luščilec z React.js, ki je avtomatiziral celoten proces primerjave cen s pridobivanjem podatkov s spletne strani podjetja, kar je omogočilo učinkovito upravljanje trgovine in cenovno strategijo. "
        },
        "meta": {
            "title": "Matija Kočevar | Izkušnje",
            "description": "Izkušnje"
        }
    },
    "skills": {
        "title": "Veščine",
        "description": "Pregled mojih tehničnih veščin in znanj",
        "meta": {
            "title": "Matija Kočevar | Veščine",
            "description": "Pregled mojih tehničnih veščin in znanj"
        },
        "sections": {
            "webDevelopment": {
                "title": "Spletni razvoj",
                "frontend": "Frontend razvoj",
                "backend": "Backend razvoj",
                "database": "Podatkovne baze & orodja"
            },
            "design": {
                "title": "Oblikovanje"
            }
        },
        "tech": {
            "react": "React",
            "nextjs": "Next.js",
            "vue": "Vue.js",
            "angular": "Angular",
            "typescript": "TypeScript",
            "javascript": "JavaScript",
            "html5": "HTML5",
            "cssSass": "CSS/SASS",
            "tailwind": "Tailwind",
            "cSharp": "C#",
            "dotnet": ".NET",
            "nodejs": "Node.js",
            "php": "PHP",
            "python": "Python",
            "postgres": "PostgreSQL",
            "mssql": "SQL Server",
            "docker": "Docker",
            "git": "Git",
            "photoshop": "Photoshop",
            "illustrator": "Illustrator",
            "figma": "Figma",
            "inkscape": "Inkscape"
        },
        "descriptions": {
            "react": "Imam obsežne izkušnje z Reactom, ki sem ga uporabljal v številnih profesionalnih projektih.\n\n Obvladam moderne React vzorce in je ogrodje, ki ga uporabljam za večino svojih projektov. Zaradi redne uporabe Next.js imam poglobljeno razumevanje React ekosistema, vključno s hooks, context API in knjižnicami za upravljanje stanja aplikacije kot je Zustand.\n\n Z lahkoto gradim SPA in kompleksne aplikacije, pri čemer implementiram najboljše prakse za zmogljivost in vzdrževanje.",
            "nextjs": "Ker sem veliko uporabljal React, je bilo naravno, da sem začel uporabljati Next.js.\n\n Imam izkušnje tako s statičnim kot s strežniškim programiranjem, API rutami in dinamičnim usmerjanjem. Z Next.js lahko zelo hitro zgradim celostne aplikacije in imam izkušnje z nameščanjem Next.js aplikacij na platforme kot je Vercel.\n\n Zmožen sem ustvariti popolnoma funkcionalne aplikacije z Next.js, vključno z avtentikacijo, pridobivanjem/shranjevanjem podatkov in rutingom.",
            "vue": "Imam veliko izkušenj z Vue.js, delal sem tako z Vue 2 kot z Vue 3 v profesionalnem okolju.\n\n Dobro poznam Options API in Composition API ter sem zgradil kompleksne aplikacije z uporabo Vuex/Pinia za upravljanje stanja aplikacije.\n\n Delal sem na obsežnih Vue aplikacijah z zahtevami po 24/7 razpoložljivosti in tudi na manjših projektih.",
            "angular": "To je ogrodje, s katerim imam najmanj izkušenj, vendar sem delal na obsežni Angular aplikaciji v profesionalnem okolju. Seznanjen sem z osnovnimi koncepti Angularja in lahko hitro se vključim v delo.\n\n Lahko implementiram routing, obrazce in HTTP zahteve v Angular aplikacijah. Prav tako lahko delam z RxJS za reaktivno programiranje in upravljanje stanja aplikacije.",
            "typescript": "TypeScript uporabljam obsežno pri vsakodnevnem delu, implementiram tipsko varne rešitve tako na frontend kot backend strani.\n\n Lahko ustvarjam kompleksne definicije tipov, vmesnike in generike za zagotavljanje kakovosti in vzdrževanja kode. Imam izkušnje s TypeScriptom v React, Vue, Angular in Next.js okoljih ter poznam napredne TypeScript funkcije kot so dekoratorji in preslikani tipi. Lahko implementiram tipsko varne API-je in knjižnice, kar zagotavlja, da je moja koda robustna in lahko razumljiva.\n\n V vseh svojih projektih raje uporabljam TypeScript kot JavaScript in lahko enostavno pretvorim JavaScript kodo v TypeScript.",
            "javascript": "Čeprav predvsem uporabljam TypeScript, imam močno podlago v JavaScriptu in lahko delam tako z ES5 kot ES6+ funkcijami.\n\n Poznam moderno JavaScript sintakso, vključno z async/await, destrukturiranjem in spread/rest operatorji. Lahko implementiram kompleksne algoritme in podatkovne strukture v JavaScriptu ter sem sproščen pri delu tako s funkcijskim kot objektno usmerjenim programiranjem.",
            "html5": "Imam močno razumevanje HTML5 in njegovih semantičnih elementov.\n\n Lahko ustvarim dostopno in SEO prijazno označevanje, pri čemer implementiram najboljše prakse za spletne standarde. Poznam HTML5 funkcije kot so vdelava zvoka/videa, platno in lokalna shramba. Lahko implementiram tehnike odzivnega oblikovanja z uporabo HTML5 in CSS.",
            "cssSass": "Sem vešč ustvarjanja odzivnih in vzdrževalnih CSS arhitektur z uporabo SASS.\n\n Implementiram moderne CSS funkcije kot sta Grid in Flexbox ter uporabljam SASS funkcije kot so mixini in funkcije za ustvarjanje skalabilnih stilskih rešitev.\n\n Imam dobro oko za detalje in sem zmožen ustvariti privlačne in uporabniku prijazne vmesnike.",
            "tailwind": "Tailwind CSS uporabljam obsežno v svojih projektih, kjer ustvarjam prilagojene dizajne in vzdržujem dosledne vzorce uporabniškega vmesnika.\n\n Imam izkušnje s prilagajanjem konfiguracij Tailwind, ustvarjanjem večkrat uporabnih komponent, implementacijo tem in uporabo pristopa Tailwind za stiliziranje na osnovi pripomočkov.\n\n Z lahkoto lahko ustvarim odzivne dizajne, ki zagotavljajo, da moje aplikacije izgledajo odlično na vseh napravah.",
            "cSharp": "Zgradil sem backend storitve z uporabo C# in .NET, implementiral vzorce čiste arhitekture, MVC vzorce in SOLID principe.\n\n Imam izkušnje z ASP.NET Core, Entity Framework in gradnjo RESTful API-jev. Delal sem tako na monolitnih kot mikroservisnih arhitekturah.",
            "dotnet": "Imam obsežne izkušnje z .NET ekosistemom, gradnjo spletnih API-jev in storitev. Delal sem z različnimi .NET funkcijami, vključno z injiciranjem odvisnosti, middleware in avtentikacijo. Implementiral sem tako REST API-je kot gRPC storitve.",
            "nodejs": "Zgradil sem backend storitve z Node.js z uporabo Express in NestJS, implementiral RESTful API-je in real-time funkcije z WebSockets.",
            "php": "Imam izkušnje z delom s PHP v profesionalnih okoljih, predvsem z Laravel in Symfony ogrodji.\n\n Zgradil sem RESTful API-je in integriral z različnimi podatkovnimi bazami in zunanjimi storitvami.",
            "python": "Python sem uporabljal za backend razvoj in naloge analize podatkov. Imam izkušnje z Django in FastAPI ogrodji, gradnjo RESTful API-jev in implementacijo podatkovnih procesnih cevovodov.",
            "postgres": "Redno delam s PostgreSQL. Imam dovolj izkušenj za pisanje osnovnih poizvedb in uporabo ekosistema za ustvarjanje in upravljanje podatkovnih baz.\n\n Običajno lahko sam dokončam vsako nalogo, vendar če stvari postanejo zapletene, vedno prosim za pomoč ali predam nalogo DBA-ju.",
            "mssql": "Imam izkušnje s SQL Serverjem. Imam dovolj izkušenj za pisanje osnovnih poizvedb in uporabo ekosistema za ustvarjanje in upravljanje podatkovnih baz.\n\n Običajno lahko sam dokončam vsako nalogo, vendar če stvari postanejo zapletene, vedno prosim za pomoč ali predam nalogo DBA-ju.",
            "docker": "Docker uporabljam dnevno za razvoj in namestitve, ustvarjam optimizirane večstopenjske gradnje in upravljam orkestracije vsebnikov.\n\n Imam izkušnje z Docker Compose za lokalni razvoj in omreženje vsebnikov.",
            "git": "Git uporabljam dnevno za nadzor verzij, implementiram strategije vejenja in vzdržujem čisto zgodovino commitov.\n\n Imam izkušnje z naprednimi Git funkcijami, CI/CD integracijami in sodelovalnimi razvojnimi poteki dela.",
            "photoshop": "Photoshop uporabljam za urejanje slik in ustvarjanje sredstev v spletnih razvojnih projektih.\n\n Lahko učinkovito pripravim in optimiziram slike za spletno uporabo, ustvarjam UI elemente in urejam fotografije za različne namene.",
            "illustrator": "Z Illustratorjem delam za ustvarjanje vektorske grafike in ikon za spletne projekte.\n\n Lahko oblikujem in izvozim skalabilno grafiko, pri čemer ohranjam doslednost preko različnih velikosti zaslonov.",
            "figma": "Figmo obsežno uporabljam za UI/UX oblikovanje in sodelovanje.\n\n Ustvarjam in vzdržujem oblikovalske sisteme, gradim interaktivne prototipe in učinkovito sodelujem z oblikovalskimi ekipami. Obvladam auto-layout, komponente in oblikovalske žetone.",
            "inkscape": "Inkscape uporabljam za ustvarjanje in urejanje SVG grafike za spletne projekte.\n\n Lahko učinkovito ustvarjam in optimiziram vektorsko grafiko, pri čemer ohranjam visoko kakovost preko različnih velikosti zaslonov."
        }
    },
    "interests": {
        "title": "Interests & Hobbies",
        "description": "To bo stran z interesi",
        "meta": {
            "title": "Matija Kočevar | Interesi",
            "description": "Interesi"
        },
        "youtube": {
            "title": "Moja YouTube vsebina",
            "videos": {
                "title": "Glasbeni videi",
                "loading": "Nalaganje videov...",
                "noVideos": "Ni najdenih videov",
                "navigation": {
                    "prev": "Prejšnji video",
                    "next": "Naslednji video"
                },
                "counter": "{current} od {total}"
            },
            "shorts": {
                "title": "Kratki posnetki",
                "loading": "Nalaganje kratkih posnetkov...",
                "noShorts": "Ni najdenih kratkih posnetkov",
                "navigation": {
                    "prev": "Prejšnji posnetek",
                    "next": "Naslednji posnetek"
                },
                "counter": "{current} od {total}"
            }
        }
    },
    "components": {
        "projectCard": {
            "liveDemo": "Demonstracija",
            "github": "GitHub"
        },
        "banner": {
            "title": "Preoblikovanje v teku!",
            "description": "Svoj portfelj popolnoma preurejam z novimi funkcijami in svežo obliko!",
            "previousPortfolio": "Preklopi na prejšnjo verzijo"
        },
        "themeToggle": {
            "switchMode": "Preklopi na {mode} način",
            "dark": "temni",
            "light": "svetli",
            "changeColor": "Spremeni barvo"
        }
    },
    "themes": {
        "default": "Privzeta",
        "red": "Rdeča",
        "blue": "Modra",
        "green": "Zelena",
        "yellow": "Rumena",
        "violet": "Vijolična"
    },
    "auth": {
        "signIn": {
            "title": "Prijava",
            "description": "Vnesite svoj e-poštni naslov in geslo za dostop do računa",
            "emailLabel": "E-pošta",
            "emailPlaceholder": "ime@primer.com",
            "passwordLabel": "Geslo",
            "passwordPlaceholder": "••••••••",
            "submitButton": "Prijava",
            "loadingButton": "Prijavljanje...",
            "noAccountText": "Nimate računa? Registrirajte se",
            "errors": {
                "default": "Prišlo je do napake. Prosim poskusite ponovno.",
                "invalidCredentials": "Prijava ni uspela. Preverite vaše podatke."
            }
        },
        "signUp": {
            "title": "Registracija",
            "description": "Ustvarite svoj račun za začetek",
            "firstNameLabel": "Ime",
            "lastNameLabel": "Priimek",
            "emailLabel": "E-pošta",
            "emailPlaceholder": "ime@primer.com",
            "passwordLabel": "Geslo",
            "passwordPlaceholder": "••••••••",
            "confirmPasswordLabel": "Potrdite geslo",
            "confirmPasswordPlaceholder": "••••••••",
            "submitButton": "Registracija",
            "loadingButton": "Ustvarjanje računa...",
            "hasAccountText": "Že imate račun? Prijavite se",
            "errors": {
                "default": "Registracija ni uspela. Prosim poskusite ponovno.",
                "passwordMismatch": "Gesli se ne ujemata"
            }
        },
        "signOut": "Odjava"
    }
}
